Fix README.md inaccuracies
